[
  {
    "eventText": "The Basque conflict, also known as the Spain–ETA conflict, was an armed and political conflict from 1959 to 2011 between Spain and the Basque National Liberation Movement, a group of social and political Basque organizations which sought independence from Spain and France.[citation needed] The movement was built around the separatist organization ETA,[4][5][dead link] which had launched a campaign of attacks against Spanish administrations since 1959. ETA had been proscribed as a terrorist organization by the Spanish, British,[6] French[7] and American[8] authorities at different moments. The conflict took place mostly on Spanish soil, although to a smaller degree it was also present in France, which was primarily used as a safe haven by ETA members. It was the longest running violent conflict in modern Western Europe.[9] It has been sometimes referred to as 'Europe's longest war'",
    "eventTitle": "Basque Conflict 1959 - 2011"
  },
  {
    "eventText": "Originally a Italian colony, Eritrea was assigned to Ethiopian rule. Worsening relations between Eritreans and Ethiopians led to a USSR-Eritrea sponsored civil war for Independence",
    "eventTitle": "Eritrean War of Independence, 1961 - 1991"
  },
  {
    "eventText": "A dispute over the Straits of Tiran leads Isreal to conduct a 6 day military operation against Egypt. USSR becomes increasingly agitated as Egypt was a USSR sponsor state ",
    "eventTitle": "The 6 Day War, June War, Third Arab-Israeli War 1967"
  },
  {
    "eventText": "A civil war fought between the Institutional Democratic Party and various rebel groups.",
    "eventTitle": "Guatemalan Civil War 1960 - 1996"
  },
  {
    "eventText": "The First Iraqi–Kurdish War[1] (Arabic: الحرب العراقية الكردية الأولى) also known as Aylul revolts (Kurdish: [9] شۆڕشی ئەیلوول‎) was a major event of the Iraqi–Kurdish conflict, lasting from 1961 until 1970. The struggle was led by Mustafa Barzani, in an attempt to establish an autonomous Kurdish administration in northern Iraq. Throughout the 1960s, the uprising escalated into a long war, which failed to resolve despite internal power changes in Iraq. During the war, 80% of the Iraqi army was engaged in combat with the Kurds.[10] The war ended with a stalemate in 1970, resulting in between 75,000[8] to 105,000 casualties.[7] A series of Iraqi–Kurdish negotiations followed the war in an attempt to resolve the conflict. The negotiations led to the Iraqi–Kurdish Autonomy Agreement of 1970",
    "eventTitle": "First Iraqi - Kurdish War 1961 - 1970"
  },
  {
    "eventText": "Following the end of the Malayan Emergency in 1960, the predominantly ethnic Chinese Malayan National Liberation Army, armed wing of the MCP, had retreated to the Malaysian-Thailand border where it had regrouped and retrained for future offensives against the Malaysian government. Hostilities officially re-ignited when the MCP ambushed security forces in Kroh–Betong, in the northern part of Peninsular Malaysia, on 17 June 1968. The conflict also coincided with renewed domestic tensions between ethnic Malays and Chinese in Peninsular Malaysia and regional military tensions due to the Vietnam War.",
    "eventTitle": "Communist insurgency in Malaysia 1968–1989"
  },
  {
    "eventText": "a conflict fought in the Hashemite Kingdom of Jordan between the Jordanian Armed Forces (JAF), under the leadership of King Hussein, and the Palestine Liberation Organisation (PLO), under the leadership of Yasser Arafat, primarily between 16 and 27 September 1970, with certain aspects of the conflict continuing until 17 July 1971.",
    "eventTitle": "Black September - Jordanian Civil War 1970 - 1971"
  },
  {
    "eventText": "On November 4, 1979, 52 United States diplomats and citizens were held hostage after a group of militarized Iranian college students belonging to the Muslim Student Followers of the Imam's Line, who supported the Iranian Revolution, took over the U.S. Embassy in Tehran[3][4] and seized hostages. A diplomatic standoff ensued. The hostages were held for 444 days, being released on January 20, 1981.",
    "eventTitle": "Iranian Hostage Crisis 1979 - 1981"
  },
  {
    "eventText": "The Sri Lankan Civil War (Sinhala: ශ්‍රී ලංකාවේ සිවිල් යුද්ධය; Tamil: இலங்கை உள்நாட்டுப் போர், Ilaṅkai uḷnāṭṭup pōr) was a civil war fought in Sri Lanka from 1983 to 2009. Beginning on 23 July 1983, there was an intermittent insurgency against the government by the Velupillai Prabhakaran-led Liberation Tigers of Tamil Eelam (LTTE, also known as the Tamil Tigers). The LTTE fought to create an independent Tamil state called Tamil Eelam in the north-east of the island,[33] due to the continuous discrimination and violent persecution against Sri Lankan Tamils by the Sinhalese dominated Sri Lankan Government",
    "eventTitle": "Sri Lankan Civil War 1983 - 2009"
  },
  {
    "eventText": "The Bosnian War (Serbo-Croatian: Rat u Bosni i Hercegovini / Рат у Босни и Херцеговини) was an international armed conflict that took place in Bosnia and Herzegovina between 1992 and 1995. The war is commonly seen as having started on April 6, 1992, following a number of earlier violent incidents. The war ended on December 14, 1995. The main belligerents were the forces of the Republic of Bosnia and Herzegovina and those of Herzeg-Bosnia and Republika Srpska, proto-states led and supplied by Croatia and Serbia, respectively.",
    "eventTitle": "Bosnian War - 1992 - 1995"
  }
]
